In [1]:
import pandas as pd
df = pd.read_csv("./sample_group.csv")
df

  class sex  weight  height  time
0     A   F      45     150    85
1     A   M      50     160    80
2     A   F      55     155    74
3     B   M      78     180    90
4     B   F      51     158    65
5     B   M      40     155    68
6     C   F      80     185    90
7     C   M      86     175    81
8     C   F      52     162    73

In [2]:
class_groupby = df.groupby("class")

In [7]:
class_groupby.groups

{'A': Int64Index([0, 1, 2], dtype='int64'),
 'B': Int64Index([3, 4, 5], dtype='int64'),
 'C': Int64Index([6, 7, 8], dtype='int64')}

In [6]:
class_groupby.get_group('A')

  class sex  weight  height  time
0     A   F      45     150    85
1     A   M      50     160    80
2     A   F      55     155    74

In [8]:
multi_groupby =df.groupby(["class","sex"])

In [9]:
multi_groupby.groups

{('A', 'F'): Int64Index([0, 2], dtype='int64'),
 ('A', 'M'): Int64Index([1], dtype='int64'),
 ('B', 'F'): Int64Index([4], dtype='int64'),
 ('B', 'M'): Int64Index([3, 5], dtype='int64'),
 ('C', 'F'): Int64Index([6, 8], dtype='int64'),
 ('C', 'M'): Int64Index([7], dtype='int64')}

In [15]:
multi_groupby.get_group(('B','F'))

  class sex  weight  height  time
4     B   F      51     158    65

In [10]:
multi_groupby.get_group(('A','F'))

  class sex  weight  height  time
0     A   F      45     150    85
2     A   F      55     155    74